CHANGELOG = '''
08.02.2025
🔧 Добавлены поликлинические отделения стационаров и поликлиники ТиНАО.

19.01.2025
🔧 Для сотрудников МФЦ добавлено автоматическое завершение незавершенных проверок в 23:59 каждого дня, а проверки, во время которых не обнаружено нарушений, автоматически удаляются. Для сотрудников МО -- если в течение дня проверка не завершена, но все нарушения либо исправлены, либо перенесены, проверка также закроется в 23:59. 🔥

12.01.2025
🔧 Добавлено разделение нарушений во возрасту при формировании меню -- для взрослых МО не показываются "детские" нарушения и наоборот 🔥

10.01.2025
🔧 Улучшен механизм "запоминания" нарушений в незавершенных проверках. Нарушения и проблемы, выявленные в ходе проверки, сохраняются даже после сброса состояния через кнопку /start 🔥
'''
