CHANGELOG='''
23.06.2024
🔧 теперь при переносе нарушения сотрудник МО может внести комментарий переноса. Этот комментарий будет отображаться в карточке нарушения в пункте "комментарий при переносе" при всех взаимодействиях с нарушением 🔥

20.06.2024
🔧 сотрудник МФЦ при выборе нарушения увидит, если нарушение было выявлено ранее и перенесено сотрудником МО. Это позволит избежать неоднократной регистрации нарушений, которые требуют длительного исправления. При этом если сотрудник считает, что нарушение действительно новое, есть опция все равно зарегистрировать его 🔥
🔧 небольшие изменения в интерфейсе и в формулировках сообщений для улучшения интуитивности взаимодействия

18.06.2024
🔧 теперь бот обращается к пользователям по имени и отчеству (если оно указано при регистрации, если нет - только по имени)🔥
🔧 при отправке оповещения о нарушении сотрудник МФЦ видит, сколько исполнителей получили оповещения, а до скольких оно не дошло (если пользователь есть в системе, но ни разу не воспользовался сервисом, т.е. не нажал start)

17.06.2024
🔧 проверку без нарушений теперь можно завершить сразу из карточки проверки. У таких проверок вместо кнопки "Посмотреть нарушения" теперь кнопка "Закончить проверку"

16.06.2024
🔧 добавлен функционал переноса нарушений для исполнителей МО. Наличие таких нарушений позволит закрыть проверку и их просмотр и исправление доступны в отдельном пункте меню

15.06.2024
🔧 для исполнителей МФЦ теперь можно выбрать МО и филиал. А для исполнителей МО филиал указывается при регистрации, что снижает количество шагов до начала проверки (филиал "вшит" заранее в аккаунт и его не нужно выбирать)
'''