ZONES = {
    '1. Входная группа': [],
    '2. Зона ресепшен': [],
    '3. Медицинский пост': [
        '3.1. Загрязнения в зоне медицинского поста отсутствуют',
        '3.2. Мусор, посторонние предметы в зоне медицинского поста отсутствуют',
        '3.3 Сотрудник на медицинском посту присутствует'
    ],
    '4. Зона комфортного пребывания': [],
    '5. Коридоры': [],
    '6. Туалетная комната': [],
    '7. Доступная среда': []
}

TIME_POINTS = [
    '8:00',
    '12:00',
    '15:00',
    '18:00'
]

CHOOSE = [
    'Загрузить фото',
    'Написать комментарий'
]
