CHANGELOG='''
14.06.2024
-- в меню выбора нарушений кнопка "назад" заменена на "к выбору нарушений" и перенесена вверх меню
-- в пределах одной проверки исполнитель МФЦ видит уже отмеченные нарушения (✅ около нарушения)
-- исправлена формулировка и описание нарушений
-- добавлены иконки в меню выбора зоны 
-- убрано меню авторизации, как избыточное (авторизация происходит автоматически по ID)

13.06.2024
-- в приложении теперь ведётся /changelog (доступен из меню), где вы можете ознакомиться с последними изменениями, новыми функциями и особенностями работы 🔥
-- добавлен пункт меню /feedback
Обратите внимание: кнопка доступна <b>всегда</b> и после отправки сообщений никакие данные не будут потеряны и <b>вы сможете продолжить работу</b>. Ждём ваш фидбек ❤️
'''